{
  "experience": [
    {
      "time": "Apr 2025 - present",
      "company_name": "VTI Japan",
      "location": "Shinjuku, Tokyo, Japan",
      "position": [
        {
          "position": "Junior BrSE",
          "time": "Apr 2025 - present",
          "content": [
            "Participating in training on fundamental system development processes, including requirement definition (要件定義), Basic Design (基本設計), and Detailed Design (詳細設計).",
            "Learning how to prepare basic design documents, understand use cases, and translate specifications into structured design formats."
          ]
        }
      ]
    },
    {
      "time": "Mar 2024 - Feb 2025",
      "company_name": "Sky-field Corporation",
      "location": "Toshima, Tokyo, Japan",
      "position": [
        {
          "position": "System Engineer Internship",
          "time": "Sep 2024 - Feb 2025",
          "content": [
            "Developed a quantity estimation system to enhance the efficiency of quotation calculations for the sales department.",
            "Analyzed architectural drawings to determine required materials and quantities based on area, number of windows, and other conditions.",
            "Created Excel-based input sheets and analyzed execution budgets to support cost estimation."
          ]
        },
        {
          "position": "AI Internship",
          "time": "Mar 2024 - Sep 2024",
          "content": [
            "Gained a better understanding of the process and significance of digital transformation (DX) in the Japanese architecture industry.",
            "Studied fundamental computer vision algorithms and generative models such as DCGAN and MirrorGAN."
          ]
        }
      ]
    },
    {
      "time": "Apr 2023 – Aug 2023",
      "company_name": "BRYCEN VIETNAM",
      "location": "Hue, Thua Thien Hue, Vietnam",
      "position": [
        {
          "position": "AI Internship",
          "time": "Apr 2023 – Aug 2023",
          "content": [
            "Explored development trends in the IT industry and acquired foundational computer science knowledge.",
            "Studied core concepts of Natural Language Processing (NLP) and implemented various models, including state-of-the-art (SOTA) techniques.",
            "Built a simple chatbot application using the OpenAI API."
          ]
        }
      ]
    },
    {
      "time": "Sep 2022 – Jun 2023",
      "company_name": "KIS-GE Internship Program",
      "location": "Hue, Thua Thien Hue, Vietnam",
      "position": [
        {
          "position": "Participant",
          "time": "Sep 2022 – Jun 2023",
          "content": [
            "Led a team of four to develop a game using Unity and C#, and a web application using ReactJS (front-end) and Laravel (back-end).",
            "Designed project content, assigned tasks via Trello, and managed documentation using Google Drive, fulfilling over 75% of business requirements.",
            "Planned strategies to maintain 70%+ progress rate and adjusted timelines when necessary.",
            "Developed a website that connects to the backend via APIs using the ReactJS framework.",
            "Provided Japanese–Vietnamese interpretation during meetings, classes, and school–company exchange events.",
            "Monitored task progress, submitted ideas, and coordinated reports and solutions during development."
          ]
        }
      ]
    },
    {
      "time": "May 2022 – Sep 2022",
      "company_name": "Hue University of Sciences",
      "location": "Hue, Thua Thien Hue, Vietnam",
      "position": [
        {
          "position": "Participant - Central Programming League",
          "time": "May 2022 – Sep 2022",
          "content": [
            "Studied and applied algorithms such as greedy and recursion to solve ACM-ICPC style problems.",
            "Solved practice tasks and supported peers in optimizing problem-solving approaches.",
            "Ranked in the Top 10 of the 'Central Programming League - Hue 2022' final competition."
          ]
        }
      ]
    }
  ]
}
