{ 
    "experience": [
        {
            "time": "Apr 2025 - present",
            "company_name": "VTI Japan",
            "location": "Shinjuku, Tokyo, Japan",
            "position": [
                {
                    "position": "Bridge System Engineer",
                    "time": "Apr 2025 - present",
                    "content": [
                    
                    ]
                },
            ]
        }
        {
            "time": "Mar 2024 - Feb 2025",
            "company_name": "Sky-field Corporation",
            "location": "Toshima, Tokyo, Japan",
            "position": [
                {
                    "position": "System Engineer Internship",
                    "time": "Sep 2024 - Feb 2025",
                    "content": [
                        "Developed a quantity estimation system to improve the efficiency of quotation calculations for the sales department.",
                        "Analysed construction drawings to calculate required materials and quantities based on factors such as area and number of windows.",
                        "Created user-friendly Excel input sheets and analysed execution budgets for each project to support cost estimation."
                    ]
                },
                {
                    "position": "AI Internship",
                    "time": "Mar 2024 - Sep 2024",
                    "content": [
                        "Better understanding of the process and importance of digital transformation (DX) in the architecture industry, especially in Japan.",
                        "Studying basic computer vision algorithms and automatic image generation models such as DCGAN and MirrorGAN."
                    ]
                }
            ]
        },
        {
            "time": "Apr 2023 – Aug 2023",
            "company_name": "BRYCEN VIETNAM",
            "location": "Hue, Thua Thien Hue, VietNam",
            "position": [
                {
                    "position": "AI Internship",
                    "time": "Apr 2023 – Aug 2023",
                    "content": [
                        "Understanding of development trends in the information technology industry and basic knowledge of computer science.",
                        "Studying fundamental concepts and theories of Natural Language Processing (NLP), then implementing various NLP models, including state‑of‑the‑art (SOTA) approaches.",
                        "Building a simple chatbot application using the OpenAI API key."
                    ]
                }
            ]
        },
        {
            "time": "Sep 2022 – Jun 2023",
            "company_name": "KIS-GE INTERNSHIP PROGRAM",
            "location": "Hue, Thua Thien Hue, VietNam",
            "position": [
                {
                    "position": "Participant in KIS-GE Internship Program",
                    "time": "Sep 2022 – Jun 2023",
                    "content": [
                        "Managing a team of 4 people building a game using Unity, C#, and web using ReactJs framework for front-end, and Laravel framework for back-end.",
                        "Conceptualizing, analyzing, and designing \"content\" as well as assigning work to members based on the Trello platform, storing documents using Google Drive, and meeting over 75% of business criteria.",
                        "Develop strategies and plans to keep the whole team above 70% on track and edit \"time\"lines when things go wrong.",
                        "Programming a website for a project that uses the ReactJs framework and connects to the backend via an API."
                    ]
                },
                {
                    "position": "Participant in KIS-GE Internship Program",
                    "time": "Sep 2022 – Jun 2023",
                    "content": [
                        "Japanese - Vietnamese interpretation at meetings, classes, and at exchange programs between schools, and companies with students.",
                        "Managing, submitting ideas, tracking, and monitoring work structure and progress.",
                        "Providing project reports, offering solutions, and coordinating to resolve issues that may arise during product development."
                    ]
                }
            ]
        },
        {
            "time": "May 2022 – Sep 2022",
            "company_name": "HUE UNIVERSITY OF SCIENCES",
            "location": "Hue, Thua Thien Hue, VietNam",
            "position": [
                {
                    "position": "Participant at Central Programming League",
                    "time": "May 2022 – Sep 2022",
                    "content": [
                        "Studying and analyzing algorithms (greedy, recursion, etc.) to solve problems in ACM-ICPC competitions.",
                        "Solving practice problems and supporting other members in the process of finding the best solution.",
                        "Top 10 Final Competition \"Central Programming League - Hue 2022\""
                    ]
                }
            ]
        }
    ]
}
